#整个工程的入口，需搭配海康威视相机使用，必须下载MVS（会自动配置SDK环境变量）
#可以在git中看到项目工程的编写历程版本，也可以回退到指定版本，其中未测试版本可能存在少量bug
import tkinter as tk

from camera import CameraParam
from ui import AppUI
from processimg import *

if __name__ == "__main__":
    cam_ctrl = CameraParam()
    #界面设计代码，主线程监听界面交互逻辑
    window = tk.Tk()
    app = AppUI(window, cam_ctrl)
    window.mainloop()


# ------------------运行结果示例，记录于2025-06-11----------------------
   
# [PLC ('192.168.1.10', 63011)] -------处理'Start'指令，当前区域: 1
# 获取到信息 
# 格式化对象: square, 位置: (+034.44, +009.11), 角度: -332.90, 颜色: Y
# [PLC ('192.168.1.10', 63011)] 已发送: 0xS,+034.44,+009.11,-332.90,Y
# 已将检测结果发送到PLC: (detected_objects) 个物体。
# [PLC ('192.168.1.10', 63011)] 
# 收到指令: 'OKart'

# [PLC ('192.168.1.10', 63011)] ------处理'OK'指令。
# [PLC ('192.168.1.10', 63011)] 所有工件信息已发送完毕。
# [PLC ('192.168.1.10', 63011)] 
# 收到指令: 'Start'

# [PLC ('192.168.1.10', 63011)] -------处理'Start'指令，当前区域: 2
# 获取到信息 
# 格式化对象: square, 位置: (+009.69, +010.58), 角度: -173.07, 颜色: Y
# [PLC ('192.168.1.10', 63011)] 已发送: 0xS,+009.69,+010.58,-173.07,Y
# 已将检测结果发送到PLC: (detected_objects) 个物体。
# [PLC ('192.168.1.10', 63011)] 
# 收到指令: 'OKart'
# [PLC ('192.168.1.10', 63011)] ------处理'OK'指令。
# [PLC ('192.168.1.10', 63011)] 所有工件信息已发送完毕。
# [PLC ('192.168.1.10', 63011)]
# 收到指令: 'Start'

# [PLC ('192.168.1.10', 63011)] -------处理'Start'指令，当前区域: 3
# 获取到信息
# [PLC ('192.168.1.10', 63011)] 没有检测到工件数据需要发送。
# 已将检测结果发送到PLC: (detected_objects) 个物体。
# [PLC ('192.168.1.10', 63011)]
# 收到指令: 'Start'

# [PLC ('192.168.1.10', 63011)] -------处理'Start'指令，当前区域: 4
# 获取到信息
# [PLC ('192.168.1.10', 63011)] 没有检测到工件数据需要发送。
# 已将检测结果发送到PLC: (detected_objects) 个物体。
# [PLC ('192.168.1.10', 63011)]
# 收到指令: 'Stopt'